# MongoDB Shell을 사용한 CRUD
MongoDB Shell을 사용하여 CRUD의 기본을 알아본다.  
MongoDB Shell은 JavaScript 실행 환경을 가지고 있어 JavaScript의 실행이 가능하다.
## Read
```cmd find()``` 메소드를 사용하여 collection 내의 document를 select한다.
```cmd
> db.collection.find(query, projection)
```
![image](https://user-images.githubusercontent.com/63652571/166174072-4034b613-1098-4547-bb22-87c3b453556e.png)  
다음 예제는 books collection 내의 모든 document를 select한다.  
```cmd
> db.books.find()
{ "_id" : ObjectId("57bd5f2e414be2f9e2b81770"), "title" : "Example1", "author" : "Lee", "price" : 100 }
{ "_id" : ObjectId("57bd5f34414be2f9e2b81771"), "title" : "Example2", "author" : "Lee", "price" : 200 }
{ "_id" : ObjectId("57bd5f34414be2f9e2b81772"), "title" : "Example3", "author" : "Lee", "price" : 300 }
{ "_id" : ObjectId("57bd5f34414be2f9e2b81773"), "title" : "Example4", "author" : "Lee", "price" : 400 }
{ "_id" : ObjectId("57bd5f3b414be2f9e2b81774"), "title" : "Example5", "author" : "Lee", "price" : 200, "stock" : 0 }
```
```cmd pretty()```를 사용하면 return data를 format에 맞게 출력한다.
```cmd
> db.books.find().pretty()
{
  "_id" : ObjectId("57bd5f2e414be2f9e2b81770"),
  "title" : "Example1",
  "author" : "Lee",
  "price" : 100
}
{
  "_id" : ObjectId("57bd5f34414be2f9e2b81771"),
  "title" : "Example2",
  "author" : "Lee",
  "price" : 200
}
{
  "_id" : ObjectId("57bd5f34414be2f9e2b81772"),
  "title" : "Example3",
  "author" : "Lee",
  "price" : 300
}
{
  "_id" : ObjectId("57bd5f34414be2f9e2b81773"),
  "title" : "Example4",
  "author" : "Lee",
  "price" : 400
}
{
  "_id" : ObjectId("57bd5f3b414be2f9e2b81774"),
  "title" : "Example5",
  "author" : "Lee",
  "price" : 200,
  "stock" : 0
}
```
별도 지정하지 않은 _id field가 추가되었다. 모든 document는 unique한 _id field를 갖는다.  
select할 field를 지정할 수 있다. 
_id는 지정하지 않아도 출력에 포함되므로 select할 field에 포함시키지 않을 경우에는 projection의 해당 field의 value에 0을 지정하여 명시적으로 배제하여야 한다.  
```cmd
> db.books.find({ }, { _id: 0, title: 1 })
{ "title" : "MongoDB Example" }
{ "title" : "Example1" }
{ "title" : "Example2" }
{ "title" : "Example3" }
```
SQL SELECT 구문과 find() 구문을 비교하면 다음과 같다.  
- SQL 구문
```sql
SELECT id, title, author
FROM books
```
- CMD 구문
```cmd
db.users.find(
  { },
  { title: 1, author: 1 }
)
```
- SQL 구문
```sql
SELECT title, author
FROM books
```
- CMD 구문
```cmd
db.users.find(
  { },
  { _id: 0, title: 1, author: 1 }
)
```
- SQL 구문
```sql
SELECT title, author
FROM books
WHERE price = 200
```
- CMD 구문
```cmd
db.books.find(
  { price: 200 },
  { title: 1, author: 1, _id: 0 }
)
```
projection를 생략하면 모든 field가 선택된다.  
다음은 price가 100 보다 크고(100 미포함) 400보다 작은(400 포함) document를 select한다.  
- SQL 구문
```sql
SELECT *
FROM books
WHERE price > 100
AND   price <= 400
```
- CMD 구문
```cmd
db.books.find(
  { price: { $gt: 100, $lte: 400 } }
)
```
```cmd $gt```는 greater than을 의미하는 ```cmd MongoDB Query operator```이다.  
Query operator(쿼리 연산자)에는 비교(Comparison), 논리(Logical), 요소(Element), 평가(Evaluation), 배열(Array) 등이 있다.  
그 중 사용 빈도가 높은 연산자에 대해 알아본다.  
### 비교(Comparison) 연산자
![image](https://user-images.githubusercontent.com/63652571/166174341-1ce53f98-f9a6-43bd-bf9b-4964d6f56334.png)  
다음은 price가 200보다 크고 400보다 작거나 같은 document를 select한다.  
```cmd
db.books.find(
  { price: { $gt: 200, $lte: 400 } }
)
```
### 논리 연산자
![image](https://user-images.githubusercontent.com/63652571/166174368-b659e380-e4fe-482e-a282-fb09ee1d83b0.png)  
다음은 price가 200보다 작거나 stock이 0인 document를 select한다.  
```cmd
db.books.find(
  { $or: [ { price: { $lt: 200 } }, { stock: 0 } ] }
)
```
정규표현식을 사용할 수 있다. 다음은 title이 /Example[1-2]/에 일치하는 document를 select한다.  
```cmd
db.books.find(
  { title : /Example[1-2]/ }
)
```
